#+title:     Ectorepo: Pytorch
#+author:    David Conner
#+email:     noreply@te.xel.io

A list of PyTorch repositories. To learn how to use this Repo repo, see the
the [[https://github.com/ectorepo/ectorepo][ectorepo/ectorepo]] Repo ... repo.

#+begin_src xml :tangle default.xml
<?xml version="1.0" encoding="utf-8"?>
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="pytorch.xml"/>

  <project name="patrick-kidger/signatory" path="path/signatory" revision="refs/heads/master" />
</manifest>
#+end_src

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src

* GraphQL Params

#+name: nrepos
#+begin_src emacs-lisp :results replace value
"100"
#+end_src

#+RESULTS: nrepos
| 100 |

#+name: gitorg
#+begin_src emacs-lisp :results replace value
"pytorch"
#+end_src

#+RESULTS: gitorg
| pytorch |

#+name: updatedAfter
#+header: :var date=(format-time-string "%Y-%m-%d" (seconds-to-time 0) t)
#+begin_src emacs-lisp :results replace value
date
#+end_src

#+RESULTS: updatedAfter
: 1970-01-01

